#include "ft_printf.h"

int main(void)
{
	//не работает..
//		ft_printf("(myy[d])[%.h10d]",-21474831111111);
//		printf("(myy[d])[%.h10d]",-21474831111111);

//	printf("(org[d])[%10.10d]\n\n", -21474831111111);
//	ft_printf("(myy[d])[%10.10d]",-21474831111111);
//	ft_printf("(myy[d])[%l10.10d]",21474831111111);
//	printf("(org[d])[%l10.10d]\n\n", 21474831111111);
//
//		ft_printf("(myy[d])[%10.6d]",-21474831111111);
//		printf("(myy[d])[%10.6d]",-21474831111111);



//	 ширины больше точности !
	ft_printf("1(myy[d])[%10.9d]", +123456789);
	printf("1(org[d])[%10.9d]\n",+123456789);
	ft_printf("1(myy[d])[%10.9d]", -123456789);
	printf("1(org[d])[%10.9d]\n\n",-123456789);

	ft_printf("2(myy[d])[%-10.9d]", 123456789);
	printf("2(org[d])[%-10.9d]\n",123456789);
	ft_printf("2(myy[d])[%+10.9d]", 123456789);
	printf("2(org[d])[%+10.9d]\n\n",123456789);

	ft_printf("3(myy[d])[%10.-9d]", 123456789);
	printf("3(org[d])[%10.-9d]\n",123456789);
	ft_printf("3(myy[d])[%10.+9d]", 123456789);
	printf("3(org[d])[%10.+9d]\n\n",123456789);

	ft_printf("4(myy[d])[%10.+-9d]", -123456789);
	printf("4(org[d])[%10.+-9d]\n",-123456789);
	ft_printf("4(myy[d])[%10.+-9d]", -123456789);
	printf("4(org[d])[%10.+-9d]\n\n",-123456789);
//
	ft_printf("5(myy[d])[%10.+-9d]", +123456789);
	printf("5(org[d])[%10.+-9d]\n",+123456789);
	ft_printf("5(myy[d])[%10.-+9d]", +123456789);
	printf("5(org[d])[%10.-+9d]\n\n",+123456789);

	ft_printf("6(myy[d])[%10.+-9d]", -123456789);
	printf("6(org[d])[%10.+-9d]\n",-123456789);
	ft_printf("6(myy[d])[%10.-+9d]", -123456789);
	printf("6(org[d])[%10.-+9d]\n\n",-123456789);

	ft_printf("7(myy[d])[%+-10.9d]", 123456789);
	printf("7(org[d])[%+-10.9d]\n",123456789);
	ft_printf("7(myy[d])[%-+10.9d]", 123456789);
	printf("7(org[d])[%-+10.9d]\n\n",123456789);

	ft_printf("8(myy[d])[%+-10.9d]", -123456789);
	printf("8(org[d])[%+-10.9d]\n",-123456789);
	ft_printf("8(myy[d])[%-+10.9d]", -123456789);
	printf("8(org[d])[%-+10.9d]\n\n",-123456789);

//
//
//
//	 точность больше ширины  !
	ft_printf("1(myy[d])[%10.15d]", +123456789);
	printf("1(org[d])[%10.15d]\n", +123456789);
	ft_printf("1(myy[d])[%10.15d]", -123456789);
	printf("1(org[d])[%10.15d]\n\n", -123456789);

	ft_printf("2(myy[d])[%-10.15d]", 123456789);
	printf("2(org[d])[%-10.15d]\n", 123456789);
	ft_printf("2(myy[d])[%+10.15d]", 123456789);
	printf("2(org[d])[%+10.15d]\n\n", 123456789);

	ft_printf("3(myy[d])[%10.-15d]", 123456789);
	printf("3(org[d])[%10.-15d]\n",123456789);
	ft_printf("3(myy[d])[%10.+15d]", 123456789);
	printf("3(org[d])[%10.+15d]\n\n",123456789);
//
	ft_printf("4(myy[d])[%10.+-15d]", -123456789);
	printf("4(org[d])[%10.+-15d]\n",-123456789);
	ft_printf("4(myy[d])[%10.+-15d]", -123456789);
	printf("4(org[d])[%10.+-15d]\n\n",-123456789);

	ft_printf("5(myy[d])[%10.+-15d]", 123456789);
	printf("5(org[d])[%10.+-15d]\n",123456789);
	ft_printf("5(myy[d])[%10.-+15d]", 123456789);
	printf("5(org[d])[%10.-+15d]\n\n",123456789);

	ft_printf("6(myy[d])[%10.+-15d]", -123456789);
	printf("6(org[d])[%10.+-15d]\n",-123456789);
	ft_printf("6(myy[d])[%10.-+15d]", -123456789);
	printf("6(org[d])[%10.-+15d]\n\n",-123456789);

	ft_printf("7(myy[d])[%+-10.15d]", 123456789);
	printf("7(org[d])[%+-10.15d]\n",123456789);
	ft_printf("7(myy[d])[%-+10.15d]", 123456789);
	printf("7(org[d])[%-+10.15d]\n\n",123456789);

	ft_printf("8(myy[d])[%+-10.15d]", -123456789);
	printf("8(org[d])[%+-10.15d]\n",-123456789);
	ft_printf("8(myy[d])[%-+10.15d]", -123456789);
	printf("8(org[d])[%-+10.15d]\n\n",-123456789);


// точность == аргументу
	ft_printf("1(myy[d])[%10.10d]", +1234567899111);
	printf("1(org[d])[%10.10d]\n",+1234567899111);
	ft_printf("1(myy[d])[%10.10d]", -1234567899111);
	printf("1(org[d])[%10.10d]\n\n",-1234567899111);
//
	ft_printf("2(myy[d])[%-10.10d]", 1234567899111);
	printf("2(org[d])[%-10.10d]\n",1234567899111);
	ft_printf("2(myy[d])[%+10.10d]", 1234567899111);
	printf("2(org[d])[%+10.9d]\n\n",1234567899111);

	ft_printf("3(myy[d])[%10.-10d]", 1234567899111);
	printf("3(org[d])[%10.-10d]\n",1234567899111);
	ft_printf("3(myy[d])[%10.+10d]", 1234567899111);
	printf("3(org[d])[%10.+10d]\n\n",1234567899111);

	ft_printf("4(myy[d])[%10.+-10d]", -1234567899111);
	printf("4(org[d])[%10.+-10d]\n",-1234567899111);
	ft_printf("4(myy[d])[%10.+-10d]", -1234567899111);
	printf("4(org[d])[%10.+-10d]\n\n",-1234567899111);

	ft_printf("5(myy[d])[%10.+-10d]", +1234567899111);
	printf("5(org[d])[%10.+-10d]\n",+1234567899111);
	ft_printf("5(myy[d])[%10.-+10d]", +1234567899111);
	printf("5(org[d])[%10.-+10d]\n\n",+1234567899111);
//
	ft_printf("6(myy[d])[%10.+-10d]", -1234567899111);
	printf("6(org[d])[%10.+-10d]\n",-1234567899111);
	ft_printf("6(myy[d])[%10.-+10d]", -1234567899111);
	printf("6(org[d])[%10.-+10d]\n\n",-1234567899111);
//
	ft_printf("7(myy[d])[%+-10.10d]", 1234567899111);
	printf("7(org[d])[%+-10.10d]\n",1234567899111);
	ft_printf("7(myy[d])[%-+10.10d]", 1234567899111);
	printf("7(org[d])[%-+10.10d]\n\n",1234567899111);

	ft_printf("8(myy[d])[%+-10.10d]", -1234567899111);
	printf("8(org[d])[%+-10.10d]\n",-1234567899111);
	ft_printf("8(myy[d])[%-+10.10d]", -1234567899111);
	printf("8(org[d])[%-+10.10d]\n\n",-1234567899111);
//
//
//
//	сделать нормальный вывод со всеми модификаторами !!!
	ft_printf("1(myy[d])[%10.l10d]", 123456789);
	printf("1(org[d])[%10.l10d]\n", 123456789);
	ft_printf("1(myy[d])[%15.l10d]", 123456789);
	printf("1(org[d])[%15.l10d]\n\n", 123456789);
//
	ft_printf("2(myy[d])[%10.l20d]", 123456789);
	printf("2(org[d])[%10.l20d]\n", 123456789);
	ft_printf("2(myy[d])[%l20d]", 123456789);
	printf("2(org[d])[%l20d]\n\n", 123456789);

	ft_printf("3(myy[d])[%10.l10d]", 123456789);
	printf("3(org[d])[%10.l10d]\n", 123456789);
	ft_printf("3(myy[d])[%15.l10d]", 123456789);
	printf("3(org[d])[%15.l10d]\n\n", 123456789);

	ft_printf("4(myy[d])[% 10. h10d]", 123456789);
	printf("4(org[d])[% 10. h10d]\n", 123456789);
	ft_printf("4(myy[d])[% h20d]", 123456789);
	printf("4(org[d])[% h20d]\n\n", 123456789);
//
//
//
	ft_printf("1(myy[d])[%hd]", 327678);
	printf("1(org[d])[%hd]\n", 327678);
	ft_printf("1(myy[d])[%h+d]", 327678);
	printf("1(org[d])[%h+d]\n\n", 327678);

	ft_printf("1(myy[d])[%h-d]", 327678);
	printf("1(org[d])[%h-d]\n", 327678);
	ft_printf("1(myy[d])[%h-d]", 327678);
	printf("1(org[d])[%h-d]\n\n", 327678);

	ft_printf("1(myy[d])[%h-d]", 327677);
	printf("1(org[d])[%h-d]\n", 327677);
	ft_printf("1(myy[d])[%h-d]", 327677);
	printf("1(org[d])[%h-d]\n\n", 327677);

	ft_printf("1(myy[d])[%h - 0d]", 327678);
	printf("1(org[d])[%h - 0d]\n", 327678);
	ft_printf("1(myy[d])[%h - 0d]", 327678);
	printf("1(org[d])[%h - 0d]\n\n", 327678);
//
//
//
//	проверить все с пробелма # и 0 (анбихейвин)
	ft_printf("1(myy[d])[%0+ -10d]", 123456789);
	printf("1(org[d])[%0+ -10d]\n", 123456789);
	ft_printf("1(myy[d])[%0 - 10d]", 123456789);
	ft_printf("1(myy[d])[%0- 10d]", 123456789);
	ft_printf("1(myy[d])[%0 -10d]", 123456789);
	printf("1(org[d])[%0- 10d]\n", 123456789);
	printf("1(org[d])[%0 -10d]\n", 123456789);
//
//
//
//
	printf("|len = %i", printf("привет%10iA", 100));
//
//
//
//
//
//
}