#include "ft_printf.h"

//int main(void)
//{

//работаем с флагом Uu
//		ft_printf("(myy[d])[%.h10d]",-21474831111111);
//		printf("(myy[d])[%.h10d]",-21474831111111);

//	printf("(org[d])[%10.10d]\n\n", -21474831111111);
//	ft_printf("(myy[d])[%10.10d]",-21474831111111);
//	ft_printf("(myy[d])[%l10.10d]",21474831111111);
//	printf("(org[d])[%l10.10d]\n\n", 21474831111111);

//		ft_printf("(myy[d])[%10.6d]",-21474831111111);
//		printf("(myy[d])[%10.6d]",-21474831111111);



//	 ширины больше точности !
//	ft_printf("1(myy[d])[%10.9d]", +123456789);
//	printf("1(org[d])[%10.9d]\n",+123456789);
//	ft_printf("1(myy[d])[%10.9d]", -123456789);
//	printf("1(org[d])[%10.9d]\n\n",-123456789);
//
//	ft_printf("2(myy[d])[%-10.9d]", 123456789);
//	printf("2(org[d])[%-10.9d]\n",123456789);
//	ft_printf("2(myy[d])[%+10.9d]", 123456789);
//	printf("2(org[d])[%+10.9d]\n\n",123456789);
//
//	ft_printf("3(myy[d])[%10.-9d]", 123456789);
//	printf("3(org[d])[%10.-9d]\n",123456789);
//	ft_printf("3(myy[d])[%10.+9d]", 123456789);
//	printf("3(org[d])[%10.+9d]\n\n",123456789);
//
//	ft_printf("4(myy[d])[%10.+-9d]", -123456789);
//	printf("4(org[d])[%10.+-9d]\n",-123456789);
//	ft_printf("4(myy[d])[%10.+-9d]", -123456789);
//	printf("4(org[d])[%10.+-9d]\n\n",-123456789);

//	ft_printf("5(myy[d])[%10.+-9d]", +123456789);
//	printf("5(org[d])[%10.+-9d]\n",+123456789);
//	ft_printf("5(myy[d])[%10.-+9d]", +123456789);
//	printf("5(org[d])[%10.-+9d]\n\n",+123456789);
//
//	ft_printf("6(myy[d])[%10.+-9d]", -123456789);
//	printf("6(org[d])[%10.+-9d]\n",-123456789);
//	ft_printf("6(myy[d])[%10.-+9d]", -123456789);
//	printf("6(org[d])[%10.-+9d]\n\n",-123456789);
//
//	ft_printf("7(myy[d])[%+-10.9d]", 123456789);
//	printf("7(org[d])[%+-10.9d]\n",123456789);
//	ft_printf("7(myy[d])[%-+10.9d]", 123456789);
//	printf("7(org[d])[%-+10.9d]\n\n",123456789);
//
//	ft_printf("8(myy[d])[%+-10.9d]", -123456789);
//	printf("8(org[d])[%+-10.9d]\n",-123456789);
//	ft_printf("8(myy[d])[%-+10.9d]", -123456789);
//	printf("8(org[d])[%-+10.9d]\n\n",-123456789);
//
//


//	 точность больше ширины  !
//	ft_printf("1(myy[d])[%10.15d]", +123456789);
//	printf("1(org[d])[%10.15d]\n", +123456789);
//	ft_printf("1(myy[d])[%10.15d]", -123456789);
//	printf("1(org[d])[%10.15d]\n\n", -123456789);
//
//	ft_printf("2(myy[d])[%-10.15d]", 123456789);
//	printf("2(org[d])[%-10.15d]\n", 123456789);
//	ft_printf("2(myy[d])[%+10.15d]", 123456789);
//	printf("2(org[d])[%+10.15d]\n\n", 123456789);
//
//	ft_printf("3(myy[d])[%10.-15d]", 123456789);
//	printf("3(org[d])[%10.-15d]\n",123456789);
//	ft_printf("3(myy[d])[%10.+15d]", 123456789);
//	printf("3(org[d])[%10.+15d]\n\n",123456789);

//	ft_printf("4(myy[d])[%10.+-15d]", -123456789);
//	printf("4(org[d])[%10.+-15d]\n",-123456789);
//	ft_printf("4(myy[d])[%10.+-15d]", -123456789);
//	printf("4(org[d])[%10.+-15d]\n\n",-123456789);
//
//	ft_printf("5(myy[d])[%10.+-15d]", 123456789);
//	printf("5(org[d])[%10.+-15d]\n",123456789);
//	ft_printf("5(myy[d])[%10.-+15d]", 123456789);
//	printf("5(org[d])[%10.-+15d]\n\n",123456789);
//
//	ft_printf("6(myy[d])[%10.+-15d]", -123456789);
//	printf("6(org[d])[%10.+-15d]\n",-123456789);
//	ft_printf("6(myy[d])[%10.-+15d]", -123456789);
//	printf("6(org[d])[%10.-+15d]\n\n",-123456789);
//
//	ft_printf("7(myy[d])[%+-10.15d]", 123456789);
//	printf("7(org[d])[%+-10.15d]\n",123456789);
//	ft_printf("7(myy[d])[%-+10.15d]", 123456789);
//	printf("7(org[d])[%-+10.15d]\n\n",123456789);
//
//	ft_printf("8(myy[d])[%+-10.15d]", -123456789);
//	printf("8(org[d])[%+-10.15d]\n",-123456789);
//	ft_printf("8(myy[d])[%-+10.15d]", -123456789);
//	printf("8(org[d])[%-+10.15d]\n\n",-123456789);
//

// точность == аргументу
//	ft_printf("1(myy[d])[%10.10d]", +1234567899111);
//	printf("1(org[d])[%10.10d]\n",+1234567899111);
//	ft_printf("1(myy[d])[%10.10d]", -1234567899111);
//	printf("1(org[d])[%10.10d]\n\n",-1234567899111);
//
//	ft_printf("2(myy[d])[%-10.10d]", 1234567899111);
//	printf("2(org[d])[%-10.10d]\n",1234567899111);
//	ft_printf("2(myy[d])[%+10.10d]", 1234567899111);
//	printf("2(org[d])[%+10.9d]\n\n",1234567899111);

//	ft_printf("3(myy[d])[%10.-10d]", 1234567899111);
//	printf("3(org[d])[%10.-10d]\n",1234567899111);
//	ft_printf("3(myy[d])[%10.+10d]", 1234567899111);
//	printf("3(org[d])[%10.+10d]\n\n",1234567899111);

//	ft_printf("4(myy[d])[%10.+-10d]", -1234567899111);
//	printf("4(org[d])[%10.+-10d]\n",-1234567899111);
//	ft_printf("4(myy[d])[%10.+-10d]", -1234567899111);
//	printf("4(org[d])[%10.+-10d]\n\n",-1234567899111);

//	ft_printf("5(myy[d])[%10.+-10d]", +1234567899111);
//	printf("5(org[d])[%10.+-10d]\n",+1234567899111);
//	ft_printf("5(myy[d])[%10.-+10d]", +1234567899111);
//	printf("5(org[d])[%10.-+10d]\n\n",+1234567899111);
//
//	ft_printf("6(myy[d])[%10.+-10d]", -1234567899111);
//	printf("6(org[d])[%10.+-10d]\n",-1234567899111);
//	ft_printf("6(myy[d])[%10.-+10d]", -1234567899111);
//	printf("6(org[d])[%10.-+10d]\n\n",-1234567899111);
//
//	ft_printf("7(myy[d])[%+-10.10d]", 1234567899111);
//	printf("7(org[d])[%+-10.10d]\n",1234567899111);
//	ft_printf("7(myy[d])[%-+10.10d]", 1234567899111);
//	printf("7(org[d])[%-+10.10d]\n\n",1234567899111);
//
//	ft_printf("8(myy[d])[%+-10.10d]", -1234567899111);
//	printf("8(org[d])[%+-10.10d]\n",-1234567899111);
//	ft_printf("8(myy[d])[%-+10.10d]", -1234567899111);
//	printf("8(org[d])[%-+10.10d]\n\n",-1234567899111);



//	сделать нормальный вывод со всеми модификаторами !!!
//	ft_printf("1(myy[d])[%10.l10d]", 123456789);
//	printf("1(org[d])[%10.l10d]\n", 123456789);
//	ft_printf("1(myy[d])[%15.l10d]", 123456789);
//	printf("1(org[d])[%15.l10d]\n\n", 123456789);

//	ft_printf("2(myy[d])[%10.l20d]", 123456789);
//	printf("2(org[d])[%10.l20d]\n", 123456789);
//	ft_printf("2(myy[d])[%l20d]", 123456789);
//	printf("2(org[d])[%l20d]\n\n", 123456789);
//
//	ft_printf("3(myy[d])[%10.l10d]", 123456789);
//	printf("3(org[d])[%10.l10d]\n", 123456789);
//	ft_printf("3(myy[d])[%15.l10d]", 123456789);
//	printf("3(org[d])[%15.l10d]\n\n", 123456789);
//
//	ft_printf("4(myy[d])[% 10. h10d]", 123456789);
//	printf("4(org[d])[% 10. h10d]\n", 123456789);
//	ft_printf("4(myy[d])[% h20d]", 123456789);
//	printf("4(org[d])[% h20d]\n\n", 123456789);



//	ft_printf("1(myy[d])[%hd]", 327678);
//	printf("1(org[d])[%hd]\n", 327678);
//	ft_printf("1(myy[d])[%h+d]", 327678);
//	printf("1(org[d])[%h+d]\n\n", 327678);
//
//	ft_printf("1(myy[d])[%h-d]", 327678);
//	printf("1(org[d])[%h-d]\n", 327678);
//	ft_printf("1(myy[d])[%h-d]", 327678);
//	printf("1(org[d])[%h-d]\n\n", 327678);
//
//	ft_printf("1(myy[d])[%h-d]", 327677);
//	printf("1(org[d])[%h-d]\n", 327677);
//	ft_printf("1(myy[d])[%h-d]", 327677);
//	printf("1(org[d])[%h-d]\n\n", 327677);
//
//	ft_printf("1(myy[d])[%h - 0d]", 327678);
//	printf("1(org[d])[%h - 0d]\n", 327678);
//	ft_printf("1(myy[d])[%h - 0d]", 327678);
//	printf("1(org[d])[%h - 0d]\n\n", 327678);



//	проверить все с пробелма # и 0 (анбихейвин)
//	ft_printf("1(myy[d])[%0+ -10d]", 123456789);
//	printf("1(org[d])[%0+ -10d]\n", 123456789);
//	ft_printf("1(myy[d])[%0 - 10d]", 123456789);
//	ft_printf("1(myy[d])[%0- 10d]", 123456789);
//	ft_printf("1(myy[d])[%0 -10d]", 123456789);
//	printf("1(org[d])[%0- 10d]\n", 123456789);
//	printf("1(org[d])[%0 -10d]\n", 123456789);
//
//
//
//
//	ft_printf("привет%10d", 100);
//	ft_printf("|len=%i", ft_printf("привет%j10.10d", 111));
//	printf("\n|len=%i", printf("привет%j10.10d", 111));
//

//	return (0);
//}



//int main(void)
//{
	//работаем с флагом Uu
//		ft_printf("(myy[u])[%.h10u]",-21474831111111);
//		printf("(myy[u])[%.h10u]",-21474831111111);
//
//	printf("(org[u])[%10.10u]\n\n", -21474831111111);
//	ft_printf("(myy[u])[%10.10u]",-21474831111111);
//	ft_printf("(myy[u])[%l10.10u]",21474831111111);
//	printf("(org[u])[%l10.10u]\n\n", 21474831111111);

//		ft_printf("(myy[u])[%10.6u]",-21474831111111);
//		printf("(myy[u])[%10.6u]",-21474831111111);
//
//
//
//	 ширины больше точности !
//	ft_printf("1(myy[u])[%10.9u]", +123456789);
//	printf("1(org[u])[%10.9u]\n",+123456789);
//	ft_printf("1(myy[u])[%10.9u]", -123456789);
//	printf("1(org[u])[%10.9u]\n\n",-123456789);

//	ft_printf("2(myy[d])[%+-11.9u]", 123456789);
//	printf("2(org[d])[%+-11.9u]\n",123456789);
//	ft_printf("2(myy[d])[%+-8.-15u]", 123456789);
//	printf("2(org[d])[%+-8.-15u]\n",123456789);
//
//	ft_printf("2(myy[d])[%-15u]", 123456789);
//	printf("2(org[d])[%-15u]\n",123456789);








//	ft_printf("2(myy[d])[%15.9u]", 123456789);
//	printf("2(org[d])[%15.9u]\n\n",123456789);
//
//	ft_printf("3(myy[d])[%10.-9u]", 123456789);
//	printf("3(org[d])[%10.-9u]\n",123456789);
//	ft_printf("3(myy[d])[%10.+9u]", 123456789);
//	printf("3(org[d])[%10.+9u]\n\n",123456789);
//
//	ft_printf("4(myy[d])[%10.+-9u]", -123456789);
//	printf("4(org[d])[%10.+-9u]\n",-123456789);
//	ft_printf("4(myy[d])[%10.+-9u]", -123456789);
//	printf("4(org[d])[%10.+-9u]\n\n",-123456789);
//
//	ft_printf("5(myy[d])[%10.+-9u]", +123456789);
//	printf("5(org[d])[%10.+-9u]\n",+123456789);
//	ft_printf("5(myy[d])[%10.-+9u]", +123456789);
//	printf("5(org[d])[%10.-+9u]\n\n",+123456789);

//	ft_printf("6(myy[d])[%10.+-9u]", -123456789);
//	printf("6(org[d])[%10.+-9u]\n",-123456789);
//	ft_printf("6(myy[d])[%10.-+9u]", -123456789);
//	printf("6(org[d])[%10.-+9u]\n\n",-123456789);

//	ft_printf("7(myy[d])[%+-20.15u]", 123456789);
//	printf("7(org[d])[%+-20.15u]\n",123456789);
//	ft_printf("7(myy[d])[%-+20.15u]", 123456789);
//	printf("7(org[d])[%-+20.15u]\n\n",123456789);
////
//	ft_printf("8(myy[d])[%+10.9u]", -123456789);
//	printf("8(org[d])[%+10.9u]\n", -123456789);
//	ft_printf("8(myy[d])[%+10.9u]", 123456789);
//	printf("8(org[d])[%+10.9u]\n", 123456789);
//	ft_printf("8(myy[d])[%-+10.9u]", -123456789);
//	printf("8(org[d])[%-+10.9u]\n\n",-123456789);

//
//
//	 точность больше ширины  !
//	ft_printf("1(myy[d])[%10.15u]", +123456789);
//	printf("1(org[d])[%10.15u]\n", +123456789);
//	ft_printf("1(myy[d])[%10.15u]", -123456789);
//	printf("1(org[d])[%10.15u]\n\n", -123456789);
//
//	ft_printf("2(myy[d])[%-10.15u]", 123456789);
//	printf("2(org[d])[%-10.15u]\n", 123456789);
//	ft_printf("2(myy[d])[%+10.15u]", 123456789);
//	printf("2(org[d])[%+10.15u]\n\n", 123456789);
//	ft_printf("2(myy[d])[%+11.7u]", 123456789);
//	printf("2(org[d])[%+11.7u]\n\n", 123456789);
//	ft_printf("2(myy[d])[%-11.7u]", 123456789);
//	printf("2(org[d])[%-11.7u]\n", 123456789);

//
//	ft_printf("3(myy[d])[%10.-15u]", 123456789);
//	printf("3(org[d])[%10.-15u]\n",123456789);
//	ft_printf("3(myy[d])[%20.+16u]", 123456789);
//	printf("3(org[d])[%20.+16u]\n\n",123456789);
//
//	ft_printf("4(myy[d])[%12.+-15u]", -123456789);
//	printf("4(org[d])[%12.+-15u]\n",-123456789);
//	ft_printf("4(myy[d])[%10.+-15u]", -123456789);
//	printf("4(org[d])[%10.+-15u]\n\n",-123456789);

//	ft_printf("5(myy[d])[%10.+-15u]", 123456789);
//	printf("5(org[d])[%10.+-15u]\n",123456789);
//	ft_printf("5(myy[d])[%10.-+15u]", 123456789);
//	printf("5(org[d])[%10.-+15u]\n\n",123456789);
//
//	ft_printf("6(myy[d])[%10.+-15u]", -123456789);
//	printf("6(org[d])[%10.+-15u]\n",-123456789);
//	ft_printf("6(myy[d])[%10.-+15u]", -123456789);
//	printf("6(org[d])[%10.-+15u]\n\n",-123456789);

//	ft_printf("7(myy[d])[%+-10.15u]", 123456789);
//	printf("7(org[d])[%+-10.15u]\n",123456789);
//	ft_printf("7(myy[d])[%-+10.15u]", 123456789);
//	printf("7(org[d])[%-+10.15u]\n\n",123456789);
//
//	ft_printf("8(myy[d])[%+-10.15u]", -123456789);
//	printf("8(org[d])[%+-10.15u]\n",-123456789);
//	ft_printf("8(myy[d])[%-+10.15u]", -123456789);
//	printf("8(org[d])[%-+10.15u]\n\n",-123456789);

//
// точность == аргументу
//	ft_printf("1(myy[d])[%10.10u]", +1234567899111);
//	printf("1(org[d])[%10.10u]\n",+1234567899111);
//	ft_printf("1(myy[d])[%10.10u]", -1234567899111);
//	printf("1(org[d])[%10.10u]\n\n",-1234567899111);
//
//	ft_printf("2(myy[d])[%-10.10u]", 1234567899111);
//	printf("2(org[d])[%-10.10u]\n",1234567899111);
//	ft_printf("2(myy[d])[%+10.7u]", 1234567899111);
//	printf("2(org[d])[%+10.7u]\n\n",1234567899111);
//
//	ft_printf("3(myy[d])[%10.-10u]", 1234567899111);
//	printf("3(org[d])[%10.-10u]\n",1234567899111);
//	ft_printf("3(myy[d])[%10.+10u]", 1234567899111);
//	printf("3(org[d])[%10.+10u]\n\n",1234567899111);

//	ft_printf("4(myy[d])[%10.+-10u]", -1234567899111);
//	printf("4(org[d])[%10.+-10u]\n",-1234567899111);
//	ft_printf("4(myy[d])[%10.+-10u]", -1234567899111);
//	printf("4(org[d])[%10.+-10u]\n\n",-1234567899111);

//	ft_printf("5(myy[d])[%10.+-10u]", +1234567899111);
//	printf("5(org[d])[%10.+-10u]\n",+1234567899111);
//	ft_printf("5(myy[d])[%10.-+10u]", +1234567899111);
//	printf("5(org[d])[%10.-+10u]\n\n",+1234567899111);
//
//	ft_printf("6(myy[d])[%10.+-10u]", -1234567899111);
//	printf("6(org[d])[%10.+-10u]\n",-1234567899111);
//	ft_printf("6(myy[d])[%10.-+10u]", -1234567899111);
//	printf("6(org[d])[%10.-+10u]\n\n",-1234567899111);

//	ft_printf("7(myy[d])[%+-10.10u]", 1234567899111);
//	printf("7(org[d])[%+-10.10u]\n",1234567899111);
//	ft_printf("7(myy[d])[%-+10.10u]", 1234567899111);
//	printf("7(org[d])[%-+10.10u]\n\n",1234567899111);

//	ft_printf("8(myy[d])[%+-10.10u]", -1234567899111);
//	printf("8(org[d])[%+-10.10u]\n",-1234567899111);
//	ft_printf("8(myy[d])[%-+10.10u]", -1234567899111);
//	printf("8(org[d])[%-+10.10u]\n\n",-1234567899111);

//
//
//	сделать нормальный вывод со всеми модификаторами !!!
//	ft_printf("1(myy[d])[%10.l10u]", 123456789);
//	printf("1(org[d])[%10.l10u]\n", 123456789);
//	ft_printf("1(myy[d])[%15.l10u]", 123456789);
//	printf("1(org[d])[%15.l10u]\n\n", 123456789);

//	ft_printf("2(myy[d])[%10.l20u]", 123456789);
//	printf("2(org[d])[%10.l20u]\n", 123456789);
//	ft_printf("2(myy[d])[%l20u]", 123456789);
//	printf("2(org[d])[%l20u]\n\n", 123456789);
//
//	ft_printf("3(myy[d])[%10.l10u]", 123456789);
//	printf("3(org[d])[%10.l10u]\n", 123456789);
//	ft_printf("3(myy[d])[%15.l10u]", 123456789);
//	printf("3(org[d])[%15.l10u]\n\n", 123456789);

//	ft_printf("4(myy[d])[% 10. h10u]", 123456789);
//	printf("4(org[d])[% 10. h10u]\n", 123456789);
//	ft_printf("4(myy[d])[% h20u]", 123456789);
//	printf("4(org[d])[% h20u]\n\n", 123456789);
//
//
//
//	ft_printf("1(myy[d])[%hu]", 327678);
//	printf("1(org[d])[%hu]\n", 327678);
//	ft_printf("1(myy[d])[%h+u]", 327678);
//	printf("1(org[d])[%h+u]\n\n", 327678);

//	ft_printf("1(myy[d])[%h-u]", 327678);
//	printf("1(org[d])[%h-u]\n", 327678);
//	ft_printf("1(myy[d])[%h-u]", 327678);
//	printf("1(org[d])[%h-u]\n\n", 327678);
//
//	ft_printf("1(myy[d])[%h-u]", 327677);
//	printf("1(org[d])[%h-u]\n", 327677);
//	ft_printf("1(myy[d])[%h-u]", 327677);
//	printf("1(org[d])[%h-u]\n\n", 327677);
//
//	ft_printf("1(myy[d])[%h - 0u]", 327678);
//	printf("1(org[d])[%h - 0u]\n", 327678);
//	ft_printf("1(myy[d])[%h - 0u]", 327678);
//	printf("1(org[d])[%h - 0u]\n\n", 327678);
//
//
//
//	проверить все с пробелма # и 0 (анбихейвин)
//	ft_printf("1(myy[d])[%0+ -10u]", 123456789);
//	printf("1(org[d])[%0+ -10u]\n", 123456789);
//	ft_printf("1(myy[d])[%0 - 10u]", 123456789);
//	ft_printf("1(myy[d])[%0- 10u]", 123456789);
//	ft_printf("1(myy[d])[%0 -10u]", 123456789);
//	printf("1(org[d])[%0- 10u]\n", 123456789);
//	ft_printf("1(org[d])[%0 -10u]\n", 123456789);
//	printf("1(org[d])[%0 -10u]\n", 123456789);




//	ft_printf("привет%10d", 100);
//	ft_printf("|len=%i", ft_printf("привет%j10.10u", 111));
//	printf("\n|len=%i", printf("привет%j10.10u", 111));

//----------------------------------------------
//ломаються при этих тестах !
//	ft_printf("7(myy[d])[%+-20.15u]", 123456789);
//	printf("7(org[d])[%+-20.15u]\n",123456789);
//	ft_printf("7(myy[d])[%-+20.15u]", 123456789);
//	printf("7(org[d])[%-+20.15u]\n\n",123456789);
//
//	ft_printf("8(myy[d])[%+10.9u]", -123456789);
//	printf("8(org[d])[%+10.9u]\n", -123456789);
//	ft_printf("8(myy[d])[%+10.9u]", 123456789);
//	printf("8(org[d])[%+10.9u]\n", 123456789);
//	ft_printf("8(myy[d])[%-+10.9u]", -123456789);
//	printf("8(org[d])[%-+10.9u]\n\n",-123456789);
//
//
//	ft_printf("2(myy[d])[%-10.10u]", 1234567899111);
//	printf("2(org[d])[%-10.10u]\n",1234567899111);
//	ft_printf("2(myy[d])[%+10.7u]", 1234567899111);
//	printf("2(org[d])[%+10.7u]\n\n",1234567899111);
//
//
//	ft_printf("1(myy[d])[%0+ -10u]", 123456789);
//	printf("1(org[d])[%0+ -10u]\n", 123456789);
//	ft_printf("1(myy[d])[%0 - 10u]", 123456789);
//	ft_printf("1(myy[d])[%0- 10u]", 123456789);
//	ft_printf("1(myy[d])[%0 -10u]", 123456789);
//	printf("1(org[d])[%0- 10u]\n", 123456789);
//	ft_printf("1(org[d])[%0 -10u]\n", 123456789);
//	printf("1(org[d])[%0 -10u]\n", 123456789);


//	return (0);
//}

int main(void)
{
	//работаем с флагом Xx
//	ft_printf("1(myy[x])[%10x]", 123456789);
//	printf("1(org[x])[%10x]\n", 123456789);

	ft_printf("1(myy[x])[%3x]", 123);
	printf("1(org[x])[%3x]\n", 123);
//	ft_printf("|len=%i", ft_printf("привет%x", 123456789));
//	printf("\n|len=%i", printf("привет%x", 123456789));

	return (0);
}
